# coding=utf8

import random
import time
import copy


# ----------深拷贝/浅拷贝的使用案例-----------
"""
赋值：对象的引用；
浅拷贝：拷贝父对象，不会拷贝父对象下面的子对象；
深拷贝：copy 模块的 deepcopy 方法，完全拷贝了父对象及其子对象；
下面为代码实例：
"""
a = [1, 2, 3, 4, ['a', 'b']] #原始对象
b = a                       #赋值，传对象的引用
c = copy.copy(a)            #对象拷贝，浅拷贝
d = copy.deepcopy(a)        #对象拷贝，深拷贝
a.append(5)                 #修改对象a
a[4].append('c')            #修改对象a中的['a', 'b']数组对象
 
print( 'a = ', a )
print( 'b = ', b )
print( 'c = ', c )
print( 'd = ', d )

# 输出结果
# ('a = ', [1, 2, 3, 4, ['a', 'b', 'c'], 5])
# ('b = ', [1, 2, 3, 4, ['a', 'b', 'c'], 5])
# ('c = ', [1, 2, 3, 4, ['a', 'b', 'c']])
# ('d = ', [1, 2, 3, 4, ['a', 'b']])
